ViniBR01/stm32-bare-metal/tests/uart/test_uart.c
/*
 * test_uart.c — Host unit tests for drivers/src/uart.c
 *
 * Two tiers of tests:
 *
 * Tier 2 — Pure function tests (uart_calc.h)
 *   uart_compute_baud_divisor, uart_circ_bytes_available
 *   No register access; test the mathematical logic directly.
 *
 * Tier 1 — Register configuration tests
 *   uart_init, uart_write, uart_read, uart_write_dma,
 *   uart_start_rx_dma, uart_stop_rx_dma, error flag handling,
 *   and RX callback dispatch (via direct USART2_IRQHandler() call).
 *
 *   Note: uart_read() and uart_write() poll USART2->SR flags.
 *   Tests that exercise these functions must pre-seed the SR register
 *   (SR_TXE / SR_RXNE) so the polling loops exit immediately.
 *
 *   Note: uart_init() calls dma_stream_init() which tracks allocation state
 *   in a static table inside dma.c. After the first uart_init(), the TX
 *   stream (DMA1_Stream6) stays allocated across test cases even after
 *   test_periph_reset(). DMA register checks that depend solely on
 *   dma_stream_init() (PAR, CR base) are therefore only reliable on the
 *   first call and are limited to the dedicated init tests below.
 *
 * setUp() zeros all fakes and seeds a 16 MHz clock via rcc_init() so that
 * rcc_get_apb1_clk() returns a known value for BRR tests.
 */

#include "unity.h"
#include "stm32f4xx.h"  /* stub: TypeDefs + fake peripheral declarations */
#include "irq_priorities.h"
#include "critical_section.h"
#include "rcc.h"
#include "uart.h"
#include "uart_calc.h"

/* Timer clock seeded in setUp() — 16 MHz (HSI direct, no PLL) */
#define TEST_APB1_CLK_HZ  16000000U

/* Mirror bit definitions from uart.c (not in the public header) */
#define SR_TXE     (1U << 7)
#define SR_RXNE    (1U << 5)
#define SR_IDLE    (1U << 4)
#define SR_ORE     (1U << 3)
#define SR_FE      (1U << 1)
#define SR_NF      (1U << 2)
#define CR1_TE     (1U << 3)
#define CR1_RE     (1U << 2)
#define CR1_UE     (1U << 13)
#define CR1_RXNEIE (1U << 5)
#define CR1_IDLEIE (1U << 4)
#define CR3_DMAT   (1U << 7)
#define CR3_DMAR   (1U << 6)
#define CR3_EIE    (1U << 0)

/* Forward-declare ISRs so we can call them directly to simulate interrupts */
extern void USART1_IRQHandler(void);
extern void USART2_IRQHandler(void);
extern void USART6_IRQHandler(void);
extern void DMA1_Stream6_IRQHandler(void);

/*
 * uart_write_dma() sets an internal static tx_busy flag that is not cleared
 * by test_periph_reset().  Simulate a DMA1 Stream6 transfer-complete interrupt
 * to invoke uart_tx_dma_tc_callback() and reset tx_busy to 0.
 *
 * Stream6 uses DMA1->HISR (streams 4–7), flag group FLAG_BASE_2 (bit offset 16):
 *   TCIF = bit 21
 */
static void reset_tx_busy(void)
{
    fake_DMA1.HISR |= (1U << 21);
    DMA1_Stream6_IRQHandler();
}

/* ---- Test lifecycle ------------------------------------------------------- */

static char  rx_cb_char;
static int   rx_cb_count;

static void test_rx_cb(char ch) { rx_cb_char = ch; rx_cb_count++; }

void setUp(void)
{
    test_periph_reset();
    rx_cb_char  = 0;
    rx_cb_count = 0;
    /* Seed clock cache so rcc_get_apb1_clk() returns TEST_APB1_CLK_HZ */
    rcc_init(RCC_CLK_SRC_HSI, TEST_APB1_CLK_HZ);
}

void tearDown(void) {}

/* ======================================================================== */
/* uart_compute_baud_divisor                                                  */
/* ======================================================================== */

void test_baud_divisor_50mhz_115200_is_434(void)
{
    /* (50 000 000 + 57 600) / 115 200 = 434 */
    TEST_ASSERT_EQUAL(434U, uart_compute_baud_divisor(50000000U, 115200U));
}

void test_baud_divisor_16mhz_115200_is_139(void)
{
    /* (16 000 000 + 57 600) / 115 200 = 139 */
    TEST_ASSERT_EQUAL(139U, uart_compute_baud_divisor(16000000U, 115200U));
}

void test_baud_divisor_50mhz_9600_is_5208(void)
{
    /* (50 000 000 + 4 800) / 9 600 = 5208 */
    TEST_ASSERT_EQUAL(5208U, uart_compute_baud_divisor(50000000U, 9600U));
}

void test_baud_divisor_100mhz_115200_is_868(void)
{
    /* (100 000 000 + 57 600) / 115 200 = 868 */
    TEST_ASSERT_EQUAL(868U, uart_compute_baud_divisor(100000000U, 115200U));
}

void test_baud_divisor_rounds_up_at_half(void)
{
    /* 172 800 = 1.5 × 115 200; with +half rounding: (172800 + 57600) / 115200 = 2 */
    TEST_ASSERT_EQUAL(2U, uart_compute_baud_divisor(172800U, 115200U));
}

void test_baud_divisor_rounds_down_just_below_half(void)
{
    /* 172 799 < 1.5 × 115 200; (172799 + 57600) / 115200 = 1 */
    TEST_ASSERT_EQUAL(1U, uart_compute_baud_divisor(172799U, 115200U));
}

/* ======================================================================== */
/* uart_circ_bytes_available                                                  */
/* ======================================================================== */

void test_circ_no_wrap_from_start(void)
{
    /* ndtr=90 → head=10; last_ndtr=100 → tail=0; bytes = 10 */
    TEST_ASSERT_EQUAL(10U, uart_circ_bytes_available(90U, 100U, 100U));
}

void test_circ_no_wrap_mid_buffer(void)
{
    /* ndtr=50 → head=50; last_ndtr=80 → tail=20; bytes = 30 */
    TEST_ASSERT_EQUAL(30U, uart_circ_bytes_available(50U, 80U, 100U));
}

void test_circ_no_wrap_full_buffer(void)
{
    /* ndtr=0 → head=100; last_ndtr=100 → tail=0; bytes = 100 */
    TEST_ASSERT_EQUAL(100U, uart_circ_bytes_available(0U, 100U, 100U));
}

void test_circ_no_change_returns_zero(void)
{
    /* head == tail: 0 bytes */
    TEST_ASSERT_EQUAL(0U, uart_circ_bytes_available(80U, 80U, 100U));
}

void test_circ_wrap_around(void)
{
    /* ndtr=90 → head=10; last_ndtr=10 → tail=90; wrap: (100-90)+10 = 20 */
    TEST_ASSERT_EQUAL(20U, uart_circ_bytes_available(90U, 10U, 100U));
}

void test_circ_wrap_tight(void)
{
    /* ndtr=95 → head=5; last_ndtr=5 → tail=95; wrap: (100-95)+5 = 10 */
    TEST_ASSERT_EQUAL(10U, uart_circ_bytes_available(95U, 5U, 100U));
}

/* ======================================================================== */
/* uart_init — clock enables                                                  */
/* ======================================================================== */

void test_uart_init_enables_gpioa_clock(void)
{
    uart_init();
    TEST_ASSERT_BITS_HIGH(RCC_AHB1ENR_GPIOAEN, fake_RCC.AHB1ENR);
}

