ViniBR01/stm32-bare-metal/tests/uart/test_uart.c
void test_uart_init_enables_usart2_apb1_clock(void)
{
    uart_init();
    TEST_ASSERT_BITS_HIGH(1U << 17, fake_RCC.APB1ENR);
}

/* ======================================================================== */
/* uart_init — GPIO alternate function configuration                          */
/* ======================================================================== */

void test_uart_init_pa2_mode_is_af(void)
{
    /* PA2 MODER bits [5:4] must be 0b10 (AF) */
    uart_init();
    TEST_ASSERT_EQUAL_HEX32(0x20U, fake_GPIOA.MODER & 0x30U);
}

void test_uart_init_pa3_mode_is_af(void)
{
    /* PA3 MODER bits [7:6] must be 0b10 (AF) */
    uart_init();
    TEST_ASSERT_EQUAL_HEX32(0x80U, fake_GPIOA.MODER & 0xC0U);
}

void test_uart_init_pa2_af7(void)
{
    /* PA2 AFR[0] bits [11:8] must be 7 */
    uart_init();
    TEST_ASSERT_EQUAL_HEX32(0x700U, fake_GPIOA.AFR[0] & 0xF00U);
}

void test_uart_init_pa3_af7(void)
{
    /* PA3 AFR[0] bits [15:12] must be 7 */
    uart_init();
    TEST_ASSERT_EQUAL_HEX32(0x7000U, fake_GPIOA.AFR[0] & 0xF000U);
}

/* ======================================================================== */
/* uart_init — USART2 register configuration                                  */
/* ======================================================================== */

void test_uart_init_brr_matches_baud_divisor(void)
{
    /* APB1 = 16 MHz seeded in setUp; BRR = uart_compute_baud_divisor(16M,115200) */
    uart_init();
    TEST_ASSERT_EQUAL(uart_compute_baud_divisor(TEST_APB1_CLK_HZ, 115200U),
                      fake_USART2.BRR);
}

void test_uart_init_cr1_te_re_ue_set(void)
{
    uart_init();
    TEST_ASSERT_BITS_HIGH(CR1_TE | CR1_RE | CR1_UE, fake_USART2.CR1);
}

void test_uart_init_cr1_rxneie_and_idleie_set(void)
{
    uart_init();
    TEST_ASSERT_BITS_HIGH(CR1_RXNEIE | CR1_IDLEIE, fake_USART2.CR1);
}

void test_uart_init_cr3_dmat_and_eie_set(void)
{
    uart_init();
    TEST_ASSERT_BITS_HIGH(CR3_DMAT | CR3_EIE, fake_USART2.CR3);
}

/* ======================================================================== */
/* uart_init — NVIC                                                           */
/* ======================================================================== */

void test_uart_init_nvic_usart2_irq_enabled(void)
{
    uart_init();
    uint32_t irqn = (uint32_t)USART2_IRQn;
    TEST_ASSERT_BITS_HIGH(1U << (irqn & 0x1FU), fake_NVIC.ISER[irqn >> 5U]);
}

void test_uart_init_nvic_usart2_priority(void)
{
    uart_init();
    /* NVIC_SetPriority stores (priority << (8 - __NVIC_PRIO_BITS)) */
    TEST_ASSERT_EQUAL(IRQ_PRIO_UART << (8U - __NVIC_PRIO_BITS),
                      fake_NVIC.IP[(uint32_t)USART2_IRQn]);
}

void test_uart_init_nvic_dma_tx_priority(void)
{
    uart_init();
    /* UART TX uses DMA1 Stream6 (DMA_STREAM_1_6) */
    TEST_ASSERT_EQUAL(IRQ_PRIO_DMA_HIGH << (8U - __NVIC_PRIO_BITS),
                      fake_NVIC.IP[(uint32_t)DMA1_Stream6_IRQn]);
}

void test_uart_init_nvic_dma_rx_priority(void)
{
    uart_init();
    static uint8_t buf[32];
    uart_start_rx_dma(buf, sizeof(buf));
    /* UART RX uses DMA1 Stream5 (DMA_STREAM_1_5) */
    TEST_ASSERT_EQUAL(IRQ_PRIO_DMA_LOW << (8U - __NVIC_PRIO_BITS),
                      fake_NVIC.IP[(uint32_t)DMA1_Stream5_IRQn]);
    uart_stop_rx_dma();
}

/* ======================================================================== */
/* uart_write                                                                 */
/* ======================================================================== */

void test_uart_write_puts_char_in_dr(void)
{
    /* Pre-seed TXE so the polling loop exits immediately */
    fake_USART2.SR = SR_TXE;
    uart_write('A');
    TEST_ASSERT_EQUAL('A', (char)(fake_USART2.DR & 0xFFU));
}

void test_uart_write_newline_final_dr_is_lf(void)
{
    /* uart_write('\n') sends '\r' then '\n'; last write to DR is '\n' */
    fake_USART2.SR = SR_TXE;
    uart_write('\n');
    TEST_ASSERT_EQUAL('\n', (char)(fake_USART2.DR & 0xFFU));
}

/* ======================================================================== */
/* uart_read                                                                  */
/* ======================================================================== */

void test_uart_read_returns_dr_value(void)
{
    /* Pre-seed RXNE and DR so the polling loop exits immediately */
    fake_USART2.SR = SR_RXNE;
    fake_USART2.DR = 'Z';
    TEST_ASSERT_EQUAL('Z', uart_read());
}

void test_uart_read_masks_to_8_bits(void)
{
    fake_USART2.SR = SR_RXNE;
    fake_USART2.DR = 0x1FFU;  /* 9-bit value */
    TEST_ASSERT_EQUAL((char)0xFF, uart_read());
}

/* ======================================================================== */
/* uart_write_dma                                                             */
/* ======================================================================== */

void test_uart_write_dma_sets_tx_busy(void)
{
    uart_init();
    TEST_ASSERT_EQUAL(0, uart_is_tx_busy());
    static const char buf[] = "hello";
    uart_write_dma(buf, 5U);
    TEST_ASSERT_EQUAL(1, uart_is_tx_busy());
}

void test_uart_write_dma_zero_length_does_not_set_busy(void)
{
    uart_init();
    reset_tx_busy();  /* clear tx_busy that may linger from a previous test */
    static const char buf[] = "hi";
    uart_write_dma(buf, 0U);
    TEST_ASSERT_EQUAL(0, uart_is_tx_busy());
}

void test_uart_write_dma_sets_ndtr_and_mem_addr(void)
{
    uart_init();
    reset_tx_busy();
    static const char buf[16];
    uart_write_dma(buf, 16U);
    TEST_ASSERT_EQUAL(16U, fake_DMA1_S6.NDTR);
    TEST_ASSERT_EQUAL_HEX32((uint32_t)buf, fake_DMA1_S6.M0AR);
}

void test_uart_write_dma_busy_skips_second_transfer(void)
{
    uart_init();
    reset_tx_busy();
    static const char buf1[4], buf2[4];
    uart_write_dma(buf1, 4U);   /* sets busy, M0AR → buf1 */
    uart_write_dma(buf2, 4U);   /* ignored: still busy */
    /* M0AR must still point at buf1 */
    TEST_ASSERT_EQUAL_HEX32((uint32_t)buf1, fake_DMA1_S6.M0AR);
}

/* ======================================================================== */
/* uart_start_rx_dma / uart_stop_rx_dma                                       */
/* ======================================================================== */

