ViniBR01/stm32-bare-metal/tests/uart/test_uart.c
void test_uart_start_rx_dma_enables_dmar_in_cr3(void)
{
    uart_init();
    static uint8_t buf[32];
    uart_start_rx_dma(buf, sizeof(buf));
    TEST_ASSERT_BITS_HIGH(CR3_DMAR, fake_USART2.CR3);
}

void test_uart_start_rx_dma_disables_rxneie(void)
{
    uart_init();
    static uint8_t buf[32];
    uart_start_rx_dma(buf, sizeof(buf));
    TEST_ASSERT_BITS_LOW(CR1_RXNEIE, fake_USART2.CR1);
}

void test_uart_start_rx_dma_sets_ndtr(void)
{
    uart_init();
    static uint8_t buf[64];
    uart_start_rx_dma(buf, 64U);
    TEST_ASSERT_EQUAL(64U, fake_DMA1_S5.NDTR);
}

void test_uart_start_rx_dma_sets_mem_addr(void)
{
    uart_init();
    static uint8_t buf[32];
    uart_start_rx_dma(buf, sizeof(buf));
    TEST_ASSERT_EQUAL_HEX32((uint32_t)buf, fake_DMA1_S5.M0AR);
}

void test_uart_stop_rx_dma_clears_dmar(void)
{
    uart_init();
    static uint8_t buf[32];
    uart_start_rx_dma(buf, sizeof(buf));
    uart_stop_rx_dma();
    TEST_ASSERT_BITS_LOW(CR3_DMAR, fake_USART2.CR3);
}

void test_uart_stop_rx_dma_reenables_rxneie(void)
{
    uart_init();
    static uint8_t buf[32];
    uart_start_rx_dma(buf, sizeof(buf));
    uart_stop_rx_dma();
    TEST_ASSERT_BITS_HIGH(CR1_RXNEIE, fake_USART2.CR1);
}

/* ======================================================================== */
/* Error flags                                                                */
/* ======================================================================== */

void test_overrun_error_set_on_ore_interrupt(void)
{
    fake_USART2.SR = SR_ORE;
    USART2_IRQHandler();
    TEST_ASSERT_EQUAL(1, uart_get_errors().overrun_error);
}

void test_framing_error_set_on_fe_interrupt(void)
{
    fake_USART2.SR = SR_FE;
    USART2_IRQHandler();
    TEST_ASSERT_EQUAL(1, uart_get_errors().framing_error);
}

void test_noise_error_set_on_nf_interrupt(void)
{
    fake_USART2.SR = SR_NF;
    USART2_IRQHandler();
    TEST_ASSERT_EQUAL(1, uart_get_errors().noise_error);
}

void test_uart_clear_errors_resets_all_flags(void)
{
    fake_USART2.SR = SR_ORE | SR_FE | SR_NF;
    USART2_IRQHandler();
    uart_clear_errors();
    uart_error_flags_t err = uart_get_errors();
    TEST_ASSERT_EQUAL(0, err.overrun_error);
    TEST_ASSERT_EQUAL(0, err.framing_error);
    TEST_ASSERT_EQUAL(0, err.noise_error);
}

/* ======================================================================== */
/* RX callback dispatch (simulated via direct IRQ handler call)              */
/* ======================================================================== */

void test_rx_callback_called_on_rxne(void)
{
    uart_register_rx_callback(test_rx_cb);
    fake_USART2.SR = SR_RXNE;
    fake_USART2.DR = 'X';
    USART2_IRQHandler();
    TEST_ASSERT_EQUAL(1, rx_cb_count);
    TEST_ASSERT_EQUAL('X', rx_cb_char);
}

void test_rx_callback_not_called_when_dma_rx_active(void)
{
    uart_init();
    uart_register_rx_callback(test_rx_cb);
    static uint8_t buf[16];
    uart_start_rx_dma(buf, sizeof(buf));

    /* RXNE fires but DMA RX is active — callback must NOT be invoked */
    fake_USART2.SR = SR_RXNE;
    fake_USART2.DR = 'Q';
    USART2_IRQHandler();
    TEST_ASSERT_EQUAL(0, rx_cb_count);

    uart_stop_rx_dma();
}

void test_rx_callback_receives_correct_character(void)
{
    uart_register_rx_callback(test_rx_cb);
    fake_USART2.SR = SR_RXNE;
    fake_USART2.DR = 0x42U; /* 'B' */
    USART2_IRQHandler();
    TEST_ASSERT_EQUAL(0x42, (uint8_t)rx_cb_char);
}

void test_null_rx_callback_does_not_crash(void)
{
    uart_register_rx_callback(NULL);
    fake_USART2.SR = SR_RXNE;
    fake_USART2.DR = 'A';
    USART2_IRQHandler();  /* Must not crash or assert */
    TEST_PASS();
}

/* ======================================================================== */
/* Critical section                                                           */
/* ======================================================================== */

void test_critical_section_enter_sets_basepri(void)
{
    fake_BASEPRI = 0;
    uint32_t saved = critical_section_enter();
    TEST_ASSERT_EQUAL(0U, saved);  /* previous value was 0 */
    TEST_ASSERT_EQUAL(IRQ_BASEPRI_MASK << (8U - __NVIC_PRIO_BITS), fake_BASEPRI);
    critical_section_exit(saved);
}

void test_critical_section_exit_restores_basepri(void)
{
    fake_BASEPRI = 0;
    uint32_t saved = critical_section_enter();
    critical_section_exit(saved);
    TEST_ASSERT_EQUAL(0U, fake_BASEPRI);
}

void test_critical_section_nesting(void)
{
    fake_BASEPRI = 0;
    uint32_t s1 = critical_section_enter();
    uint32_t s2 = critical_section_enter();
    /* second enter is a no-op in terms of saved value since BASEPRI is already set */
    critical_section_exit(s2);
    /* BASEPRI still set after inner exit because s2 == already-masked value */
    critical_section_exit(s1);
    TEST_ASSERT_EQUAL(0U, fake_BASEPRI);
}

/* ======================================================================== */
/* uart_init_config — USART1 (APB2, PA9 TX / PB7 RX, DMA2 streams 7/2)      */
/* ======================================================================== */

/* APB2 clock = same as APB1 in HSI-direct config seeded in setUp()          */
#define TEST_APB2_CLK_HZ  TEST_APB1_CLK_HZ

void test_uart1_init_enables_gpioa_clock(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_BITS_HIGH(RCC_AHB1ENR_GPIOAEN, fake_RCC.AHB1ENR);
}

void test_uart1_init_enables_gpiob_clock(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_BITS_HIGH(RCC_AHB1ENR_GPIOBEN, fake_RCC.AHB1ENR);
}

void test_uart1_init_enables_usart1_apb2_clock(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_BITS_HIGH(RCC_APB2ENR_USART1EN, fake_RCC.APB2ENR);
}

void test_uart1_init_pa9_mode_is_af(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* PA9 MODER bits [19:18] = 0b10 (AF) */
    TEST_ASSERT_EQUAL_HEX32(0x80000U, fake_GPIOA.MODER & 0xC0000U);
}

