ViniBR01/stm32-bare-metal/tests/uart/test_uart.c
void test_uart1_init_pb7_mode_is_af(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* PB7 MODER bits [15:14] = 0b10 (AF) */
    TEST_ASSERT_EQUAL_HEX32(0x8000U, fake_GPIOB.MODER & 0xC000U);
}

void test_uart1_init_pa9_af7(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* PA9 AFR[1] bits [7:4] must be 7 (pin 9 in second AF register, offset (9%8)*4=4) */
    TEST_ASSERT_EQUAL_HEX32(0x70U, fake_GPIOA.AFR[1] & 0xF0U);
}

void test_uart1_init_pb7_af7(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* PB7 AFR[0] bits [31:28] must be 7 (pin 7, offset (7%8)*4=28) */
    TEST_ASSERT_EQUAL_HEX32(0x70000000U, fake_GPIOB.AFR[0] & 0xF0000000U);
}

void test_uart1_init_brr_uses_apb2_clk(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* APB2 = TEST_APB2_CLK_HZ (same as APB1 in this test setup) */
    TEST_ASSERT_EQUAL(uart_compute_baud_divisor(TEST_APB2_CLK_HZ, 115200U),
                      fake_USART1.BRR);
}

void test_uart1_init_cr1_te_re_ue_set(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_BITS_HIGH(CR1_TE | CR1_RE | CR1_UE, fake_USART1.CR1);
}

void test_uart1_init_nvic_usart1_irq_enabled(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    uint32_t irqn = (uint32_t)USART1_IRQn;
    TEST_ASSERT_BITS_HIGH(1U << (irqn & 0x1FU), fake_NVIC.ISER[irqn >> 5U]);
}

void test_uart1_init_nvic_usart1_priority(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_EQUAL(IRQ_PRIO_UART << (8U - __NVIC_PRIO_BITS),
                      fake_NVIC.IP[(uint32_t)USART1_IRQn]);
}

void test_uart1_init_nvic_dma_tx_priority(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_1, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* USART1 TX uses DMA2 Stream 7 */
    TEST_ASSERT_EQUAL(IRQ_PRIO_DMA_HIGH << (8U - __NVIC_PRIO_BITS),
                      fake_NVIC.IP[(uint32_t)DMA2_Stream7_IRQn]);
}

/* ======================================================================== */
/* uart_init_config — USART6 (APB2, PC6 TX / PC7 RX, DMA2 streams 6/1)      */
/* ======================================================================== */

void test_uart6_init_enables_gpioc_clock(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_BITS_HIGH(RCC_AHB1ENR_GPIOCEN, fake_RCC.AHB1ENR);
}

void test_uart6_init_enables_usart6_apb2_clock(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_BITS_HIGH(RCC_APB2ENR_USART6EN, fake_RCC.APB2ENR);
}

void test_uart6_init_pc6_mode_is_af(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* PC6 MODER bits [13:12] = 0b10 (AF) */
    TEST_ASSERT_EQUAL_HEX32(0x2000U, fake_GPIOC.MODER & 0x3000U);
}

void test_uart6_init_pc7_mode_is_af(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* PC7 MODER bits [15:14] = 0b10 (AF) */
    TEST_ASSERT_EQUAL_HEX32(0x8000U, fake_GPIOC.MODER & 0xC000U);
}

void test_uart6_init_pc6_af8(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* PC6 AFR[0] bits [27:24] must be 8 (pin 6, offset (6%8)*4=24) */
    TEST_ASSERT_EQUAL_HEX32(0x8000000U, fake_GPIOC.AFR[0] & 0xF000000U);
}

void test_uart6_init_pc7_af8(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* PC7 AFR[0] bits [31:28] must be 8 (pin 7, offset (7%8)*4=28) */
    TEST_ASSERT_EQUAL_HEX32(0x80000000U, fake_GPIOC.AFR[0] & 0xF0000000U);
}

void test_uart6_init_brr_uses_apb2_clk(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_EQUAL(uart_compute_baud_divisor(TEST_APB2_CLK_HZ, 115200U),
                      fake_USART6.BRR);
}

void test_uart6_init_cr1_te_re_ue_set(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_BITS_HIGH(CR1_TE | CR1_RE | CR1_UE, fake_USART6.CR1);
}

void test_uart6_init_nvic_usart6_irq_enabled(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    uint32_t irqn = (uint32_t)USART6_IRQn;
    TEST_ASSERT_BITS_HIGH(1U << (irqn & 0x1FU), fake_NVIC.ISER[irqn >> 5U]);
}

void test_uart6_init_nvic_usart6_priority(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    TEST_ASSERT_EQUAL(IRQ_PRIO_UART << (8U - __NVIC_PRIO_BITS),
                      fake_NVIC.IP[(uint32_t)USART6_IRQn]);
}

void test_uart6_init_nvic_dma_tx_priority(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_6, .baud_rate = 115200U };
    uart_init_config(&cfg);
    /* USART6 TX uses DMA2 Stream 6 */
    TEST_ASSERT_EQUAL(IRQ_PRIO_DMA_HIGH << (8U - __NVIC_PRIO_BITS),
                      fake_NVIC.IP[(uint32_t)DMA2_Stream6_IRQn]);
}

/* ======================================================================== */
/* uart_init_config — invalid argument handling                               */
/* ======================================================================== */

void test_uart_init_config_null_returns_err(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, uart_init_config(NULL));
}

void test_uart_init_config_invalid_instance_returns_err(void)
{
    uart_config_t cfg = { .instance = UART_INSTANCE_COUNT, .baud_rate = 115200U };
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, uart_init_config(&cfg));
}

/* ======================================================================== */
/* main                                                                       */
/* ======================================================================== */

int main(void)
{
    UNITY_BEGIN();

