ViniBR01/stm32-bare-metal/tests/uart/test_uart.c
    /* uart_compute_baud_divisor */
    RUN_TEST(test_baud_divisor_50mhz_115200_is_434);
    RUN_TEST(test_baud_divisor_16mhz_115200_is_139);
    RUN_TEST(test_baud_divisor_50mhz_9600_is_5208);
    RUN_TEST(test_baud_divisor_100mhz_115200_is_868);
    RUN_TEST(test_baud_divisor_rounds_up_at_half);
    RUN_TEST(test_baud_divisor_rounds_down_just_below_half);

    /* uart_circ_bytes_available */
    RUN_TEST(test_circ_no_wrap_from_start);
    RUN_TEST(test_circ_no_wrap_mid_buffer);
    RUN_TEST(test_circ_no_wrap_full_buffer);
    RUN_TEST(test_circ_no_change_returns_zero);
    RUN_TEST(test_circ_wrap_around);
    RUN_TEST(test_circ_wrap_tight);

    /* uart_init — clock enables */
    RUN_TEST(test_uart_init_enables_gpioa_clock);
    RUN_TEST(test_uart_init_enables_usart2_apb1_clock);

    /* uart_init — GPIO AF configuration */
    RUN_TEST(test_uart_init_pa2_mode_is_af);
    RUN_TEST(test_uart_init_pa3_mode_is_af);
    RUN_TEST(test_uart_init_pa2_af7);
    RUN_TEST(test_uart_init_pa3_af7);

    /* uart_init — USART2 registers */
    RUN_TEST(test_uart_init_brr_matches_baud_divisor);
    RUN_TEST(test_uart_init_cr1_te_re_ue_set);
    RUN_TEST(test_uart_init_cr1_rxneie_and_idleie_set);
    RUN_TEST(test_uart_init_cr3_dmat_and_eie_set);

    /* uart_init — NVIC */
    RUN_TEST(test_uart_init_nvic_usart2_irq_enabled);
    RUN_TEST(test_uart_init_nvic_usart2_priority);
    RUN_TEST(test_uart_init_nvic_dma_tx_priority);
    RUN_TEST(test_uart_init_nvic_dma_rx_priority);

    /* uart_write */
    RUN_TEST(test_uart_write_puts_char_in_dr);
    RUN_TEST(test_uart_write_newline_final_dr_is_lf);

    /* uart_read */
    RUN_TEST(test_uart_read_returns_dr_value);
    RUN_TEST(test_uart_read_masks_to_8_bits);

    /* uart_write_dma */
    RUN_TEST(test_uart_write_dma_sets_tx_busy);
    RUN_TEST(test_uart_write_dma_zero_length_does_not_set_busy);
    RUN_TEST(test_uart_write_dma_sets_ndtr_and_mem_addr);
    RUN_TEST(test_uart_write_dma_busy_skips_second_transfer);

    /* uart_start_rx_dma / uart_stop_rx_dma */
    RUN_TEST(test_uart_start_rx_dma_enables_dmar_in_cr3);
    RUN_TEST(test_uart_start_rx_dma_disables_rxneie);
    RUN_TEST(test_uart_start_rx_dma_sets_ndtr);
    RUN_TEST(test_uart_start_rx_dma_sets_mem_addr);
    RUN_TEST(test_uart_stop_rx_dma_clears_dmar);
    RUN_TEST(test_uart_stop_rx_dma_reenables_rxneie);

    /* Error flags */
    RUN_TEST(test_overrun_error_set_on_ore_interrupt);
    RUN_TEST(test_framing_error_set_on_fe_interrupt);
    RUN_TEST(test_noise_error_set_on_nf_interrupt);
    RUN_TEST(test_uart_clear_errors_resets_all_flags);

    /* RX callback dispatch */
    RUN_TEST(test_rx_callback_called_on_rxne);
    RUN_TEST(test_rx_callback_not_called_when_dma_rx_active);
    RUN_TEST(test_rx_callback_receives_correct_character);
    RUN_TEST(test_null_rx_callback_does_not_crash);

    /* Critical section */
    RUN_TEST(test_critical_section_enter_sets_basepri);
    RUN_TEST(test_critical_section_exit_restores_basepri);
    RUN_TEST(test_critical_section_nesting);

    /* uart_init_config — USART1 */
    RUN_TEST(test_uart1_init_enables_gpioa_clock);
    RUN_TEST(test_uart1_init_enables_gpiob_clock);
    RUN_TEST(test_uart1_init_enables_usart1_apb2_clock);
    RUN_TEST(test_uart1_init_pa9_mode_is_af);
    RUN_TEST(test_uart1_init_pb7_mode_is_af);
    RUN_TEST(test_uart1_init_pa9_af7);
    RUN_TEST(test_uart1_init_pb7_af7);
    RUN_TEST(test_uart1_init_brr_uses_apb2_clk);
    RUN_TEST(test_uart1_init_cr1_te_re_ue_set);
    RUN_TEST(test_uart1_init_nvic_usart1_irq_enabled);
    RUN_TEST(test_uart1_init_nvic_usart1_priority);
    RUN_TEST(test_uart1_init_nvic_dma_tx_priority);

    /* uart_init_config — USART6 */
    RUN_TEST(test_uart6_init_enables_gpioc_clock);
    RUN_TEST(test_uart6_init_enables_usart6_apb2_clock);
    RUN_TEST(test_uart6_init_pc6_mode_is_af);
    RUN_TEST(test_uart6_init_pc7_mode_is_af);
    RUN_TEST(test_uart6_init_pc6_af8);
    RUN_TEST(test_uart6_init_pc7_af8);
    RUN_TEST(test_uart6_init_brr_uses_apb2_clk);
    RUN_TEST(test_uart6_init_cr1_te_re_ue_set);
    RUN_TEST(test_uart6_init_nvic_usart6_irq_enabled);
    RUN_TEST(test_uart6_init_nvic_usart6_priority);
    RUN_TEST(test_uart6_init_nvic_dma_tx_priority);

    /* uart_init_config — invalid args */
    RUN_TEST(test_uart_init_config_null_returns_err);
    RUN_TEST(test_uart_init_config_invalid_instance_returns_err);

    return UNITY_END();
}
